CANCEL_TICKETS_TEXT = "Отменить все поиски"
ADD_TICKET_TEXT = "Добавить билет"
SEE_ALL_TICKETS_TEXT = "Просмотреть активные поиски"
FAVORITE_TICKETS_TEXT = "Избранные маршруты"
ADD_FAVORITE_TICKET_TEXT = "⭐️ Добавить маршрут в избранные"
SEE_AVAILABLE_TICKETS_TEXT = "Просмотреть доступные билеты и время"

CANCEL_BUTTON = f"^{CANCEL_TICKETS_TEXT}"
ANOTHER_TICKET_BUTTON = f"^{ADD_TICKET_TEXT}"
SEE_ALL_TICKETS_BUTTON = f"^{SEE_ALL_TICKETS_TEXT}"
FAVORITE_TICKETS_BUTTON = f"^{FAVORITE_TICKETS_TEXT}"
SEE_AVAILABLE_TICKETS_BUTTON = f"^{SEE_AVAILABLE_TICKETS_TEXT}"

target_block_not_found_error_message = (
    "❌ Ошибка при проверке билетов {} → {}\n"
    "Неверно указаны станции или время\n"
    "Возможно поезд уже уехал\n"
    "Попробуйте снова"
)
tickets_found_message = "✅ Билет появился в продаже!\n{} → {}\n{} {}\nСсылка на сайт с билетом:\n {}"

start_message = (
    "🚂 <b>Поиск железнодорожных билетов для PASS RW</b>\n\n"
    "📝 <b>Введите данные в формате:</b>\n"
    "<b>Откуда  Куда  Дата(ГГГГ-ММ-ДД)  Время(ЧЧ:ММ)</b>\n\n"
    "🔹 <b>Пример (можно скопировать):</b>\n"
)


invalid_input_amount_message = (
    "❌ <b>Ошибка ввода данных</b>\n\n"
    "Вы ввели неверное количество параметров:\n"
    "📝 <b>Требуемый формат:</b>\n"
    "<b>Откуда  Куда  Дата(ГГГГ-ММ-ДД)  Время(ЧЧ:ММ)</b>\n\n"
    "🔹 <b>Пример правильного ввода (можно скопировать):</b>\n"
)

invalid_time_format_message = (
    "❌ <b>Неверный формат даты или времени</b>\n\n"
    "⚡ <b>Возможные причины:</b>\n"
    "• Дата и время указаны в прошлом (поезд ушел)\n"
    "📝 <b>Попробуйте снова:</b>\n"
)

error_finding_train_message = (
    "❌ <b>Ошибка при поиске маршрута</b>\n\n"
    "⚡ <b>Возможные причины:</b>\n"
    "• Неправильно указаны станции\n"
    "• Дата и время указаны в прошлом (поезд ушел)\n"
    "📝 <b>Попробуйте снова:</b>\n"
)

start_finding_tickets_message = (
    "🔍 <b>Начинаю поиск билетов</b>\n\n"
    "🚂 <b>Маршрут:</b> {} → {}\n"
    "📅 <b>Дата:</b> {}\n"
    "⏰ <b>Время:</b> {}\n\n"
    "Я сообщу вам сразу, как только билеты появятся в продаже.\n\n"
    "❌ Для отмены поиска нажмите <b>Отмена</b>\n"
    "➕ Для добавления нового поиска нажмите <b>Ещё один билет</b>"
)

request_error_message = "❌ Ошибка при проверке билетов {} → {} Попробуйте снова"

cancel_ticket_message = (
    "❌ <b>Отменено {} поиск(а)</b>\n\n"
    "Чтобы начать новый поиск, введите:\n"
    "<b>Откуда  Куда  Дата(ГГГГ-ММ-ДД)  Время(ЧЧ:ММ)</b>\n\n"
    "🔹 <b>Пример (можно скопировать):</b>\n"
)

add_ticket_message = (
    "📝 <b>Для добавления билета введите данные в формате:</b>\n"
    "<b>Откуда  Куда  Дата(ГГГГ-ММ-ДД)  Время(ЧЧ:ММ)</b>\n\n"
    "🔹 <b>Пример (можно скопировать):</b>\n"
)

see_all_tickets_message = "🔍 <b>Текущие поиски:</b>\n"

favorite_tickets_message = "💖 <b>Ваши избранные маршруты (можно скопировать):</b>\n"

see_available_tickets_message = (
    "🔍 Для просмотра доступных билетов\nвведите маршрут и дату в формате:\n"
    "<b>Откуда Куда Дата(ГГГГ-ММ-ДД)</b>\n"
    "🔹 <b>Пример:</b>\n"
    "<code>Минск-Пассажирский Толочин 2025-12-31</code>"
)
